Multisensor/validation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Multisensor Validation Log</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Vladimir Alexiev" />
</head>
<body>
<div id="content">
<h1 class="title">Multisensor Validation Log</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Intro</a>
<ul>
<li><a href="#sec-1-1">1.1. Queries</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Validation <code>[0/14]</code></a>
<ul>
<li><a href="#sec-2-1">2.1. Advanced Context Extraction Service <code>[0/2]</code></a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. <span class="todo TODO">TODO</span> Wrong prefix for Text Characteristics</a></li>
<li><a href="#sec-2-1-2">2.1.2. <span class="todo TODO">TODO</span> Crawler to decode HTML entities</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Entity Alignment Service <code>[0/5]</code></a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. <span class="todo TODO">TODO</span> Also remove taIdentConf, taIdentProv</a></li>
<li><a href="#sec-2-2-2">2.2.2. <span class="todo TODO">TODO</span> Leave Dependency Links</a></li>
<li><a href="#sec-2-2-3">2.2.3. <span class="todo TODO">TODO</span> Use Prefixes in alignment.log</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Summarization Service <code>[0/4]</code></a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. <span class="todo TODO">TODO</span> Refresh Prefixes</a></li>
<li><a href="#sec-2-3-2">2.3.2. <span class="todo TODO">TODO</span> nif:anchorOf or not?</a></li>
<li><a href="#sec-2-3-3">2.3.3. <span class="todo TODO">TODO</span> Why nif-ann:taIdentConf is 0?</a></li>
<li><a href="#sec-2-3-4">2.3.4. <span class="todo TODO">TODO</span> ms:GenericConcept vs ms:SpecificConcept</a></li>
<li><a href="#sec-2-3-5">2.3.5. <span class="todo TODO">TODO</span> Optimize Summarization Queries</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Content Alignment</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. <span class="todo TODO">TODO</span> One Annotation Per Pair&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Babis">Babis</span></span></a></li>
<li><a href="#sec-2-4-2">2.4.2. <span class="todo TODO">TODO</span> Use ms:score not fise:confidence for CAP</a></li>
<li><a href="#sec-2-4-3">2.4.3. <span class="todo TODO">TODO</span> Add to Ontology&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Vladimir">Vladimir</span></span></a></li>
<li><a href="#sec-2-4-4">2.4.4. CAP Query</a></li>
<li><a href="#sec-2-4-5">2.4.5. <span class="todo TODO">TODO</span> Other CAP Queries</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://github.com/VladimirAlexiev/VladimirAlexiev.github.io/blob/master/Multisensor/validation.org">Github Source</a>, <a href="http://VladimirAlexiev.github.io/Multisensor/validation.html">HTML Rendered version</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
From now until the end of the project I'll keep a detailed log of what I validated and defects I found.
I'll use Org-mode mechanisms to track the defects (tags TODO, DONE, CANCELED) and try to monitor email conversation to keep this up to date.
The numbers in brackets after a section name show the resolved vs total defects.
Whenever a defect is posted in Jira, I'll track the issue number.
</p>

<p>
Please contact me on skype://valexiev1 for corrections/additions.
Even better, you could <a href="https://github.com/VladimirAlexiev/VladimirAlexiev.github.io/edit/master/Multisensor/validation.org">edit this file on github</a> (it's a plain text file!) and send me a pull request.
</p>
<ul class="org-ul">
<li>Mistakes or imprecise info (eg the scope of a particular service is described wrong, or a particular issue is in fact a non-issue)
</li>
<li>When an issue is resolved
</li>
<li>When an issue should be canceled
</li>
</ul>
<p>
I'll also attend weekly calls related to RDF data and validation, and update this.
</p>

<p>
IMPORTANT: Just because an issue is listed in the section for a particular service, doesn't necessarily mean that service created the defect!
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Queries</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Below I also track questions related to queries.
But when agreed, they should be moved to gdoc <a href="https://docs.google.com/document/d/1FfkiiTYvrLzHJ5P5j34NRVGPbXml0ndpNtiNbH2osRw/edit">Multisensor SPARQL Queries</a>.
</p>

<p>
Or we could simply use the doc:
if you need a new query, or a query needs optimization, please write a comment in red,
and notify me in a gdoc comment (add +vladimir@sirma.bg to the comment).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Validation <code>[0/14]</code></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Advanced Context Extraction Service <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-23 Thu&gt;</span></span>: checked <a href="http://grinder1.multisensorproject.eu/cepfiles/rdf_validation/context_extraction_validation/0e6b24-CONTEXT_EXTRACTION-22-6-2016.ttl">0e6b24-CONTEXT_EXTRACTION-22-6-2016.ttl</a>
</p>

<p>
This service adds new Text Characteristics properties (technicality, fluency, richness) to the context.
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <span class="todo TODO">TODO</span> Wrong prefix for Text Characteristics</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Text Characteristics (technicality, fluency, richness):
</p>
<ul class="org-ul">
<li>currently use <a href="http://data.multisensor.eu/ontology#">http://data.multisensor.eu/ontology#</a>
</li>
<li>but the correct prefix is <a href="http://data.multisensorproject.eu/ontology#">http://data.multisensorproject.eu/ontology#</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> <span class="todo TODO">TODO</span> Crawler to decode HTML entities</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
It would be good if the crawler decodes HTML entities before storing in dc:subject (possibly also dc:title, dc:description). Eg:
</p>
<pre class="example">
dc:subject       "Europ&amp;auml;ische Union, ISIN_FR0003500008, Brexit,
  Erholungskurs, Europa, Paris, Gro&amp;szlig;britannien" , "Economy, Business &amp; Finance" ;
</pre>
</div>
</div>
</div>
