Multisensor/validation.html

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> <span class="todo TODO">TODO</span> nif:anchorOf or not?</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
I've been saying all along to skip <code>nif:anchorOf</code> so as not to create too many literals.
Above, UPF has done just that; while the other services emit it.
</p>

<p>
But with the number of SIMMOs loaded, it has not been too taxing for GDB.
<code>nif:anchorOf</code> has been instrumental in debugging, eg of the UTF-8 and offset mismatch issues.
</p>

<p>
<code>nif:literalAnnotation</code> and <code>nif:lemma</code> provide sufficient info about the phrase, 
so maybe we don't need <code>nif:anchorOf</code>. We could cancel this issue.
</p>
</div>
</div>

<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> <span class="todo TODO">TODO</span> Why nif-ann:taIdentConf is 0?</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
In the above example, ~nif-ann:taIdentConf is 0. 
In many other examples it's a good number, eg see below.
Is 0 some sort of bug, or does Babelfy actually return 0 confidence for some concepts?
</p>

<p>
<a href="http://grinder1.multisensorproject.eu/cepfiles/rdf_validation/concept_with_scores_16_06_2016/bf6fe4-CONCEPT_EXTRACTION-16-6-2016.ttl">bf6fe4-CONCEPT_EXTRACTION-16-6-2016.ttl</a>
</p>
<div class="org-src-container">

<pre class="src src-Turtle">@base <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/bf6fe48b8d88c1d11d5086863f4c3ad26286bda9&gt;</span>.

<span style="color: #0000ff;">&lt;#char=1814,1822&gt;</span>
        <span style="color: #a020f0;">a</span>                        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">Word</span> ;
        <span style="color: #0000ff;">&lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation#taIdentConf&gt;</span>
                <span style="color: #8b2252;">"0.7619547411890493"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
        <span style="color: #0000ff;">&lt;http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-annotation#taIdentProv&gt;</span>
                <span style="color: #0000ff;">&lt;http://babelfy.org/&gt;</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">anchorOf</span>             <span style="color: #8b2252;">"pastries"</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">beginIndex</span>           <span style="color: #8b2252;">"1814"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">dependency</span>           <span style="color: #0000ff;">&lt;#char=1806,1812&gt;</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">endIndex</span>             <span style="color: #8b2252;">"1822"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">nonNegativeInteger</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">lemma</span>                <span style="color: #8b2252;">"pastry"</span> ;
        <span style="color: #228b22;">nif:</span>literalAnnotation
          <span style="color: #8b2252;">"deep=spos=NN"</span> , 
          <span style="color: #8b2252;">"rel==member=A2|dpos=NN|end_string=1822|start_string=1814|id0=29|word=pastry|number=PL|connect_check=OK|fn=Food"</span> , 
          <span style="color: #8b2252;">"surf=spos=NN"</span> ;
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">oliaLink</span>             <span style="color: #228b22;">upf-deep:</span><span style="color: #008b8b;">COORD</span> , <span style="color: #228b22;">penn:</span><span style="color: #008b8b;">NNS</span> , <span style="color: #0000ff;">&lt;#char=1814,1822_fe&gt;</span><span style="color: #b22222;"> , </span><span style="color: #228b22;">upf-dep-syn:</span><span style="color: #008b8b;">COORD</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">nif:</span><span style="color: #008b8b;">referenceContext</span>     <span style="color: #0000ff;">&lt;#char=0,12793&gt;</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">upf-deep:</span><span style="color: #008b8b;">deepDependency</span>  <span style="color: #0000ff;">&lt;#char=1806,1812&gt;</span><span style="color: #b22222;"> ;</span>
        <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taClassRef</span>           <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">GenericConcept</span> ;
        <span style="color: #228b22;">its:</span><span style="color: #008b8b;">taIdentRef</span>           <span style="color: #228b22;">bn:</span><span style="color: #008b8b;">s00060957n</span> .
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-4" class="outline-4">
<h4 id="sec-2-3-4"><span class="section-number-4">2.3.4</span> <span class="todo TODO">TODO</span> ms:GenericConcept vs ms:SpecificConcept</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
Gerard wrote about the last example: 'generic' concept produced by Babelfy. 
Annotations of concepts produced by the concept extraction service should contain triples pointing to <code>ms:SpecificConcept</code>.
</p>

<p>
It also seems to me that concepts like "open source" and "pastry" are <code>ms:SpecificConcept</code>.
</p>
</div>
</div>

<div id="outline-container-sec-2-3-5" class="outline-4">
<h4 id="sec-2-3-5"><span class="section-number-4">2.3.5</span> <span class="todo TODO">TODO</span> Optimize Summarization Queries</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
Gerard wrote some of the Summarization queries are slow.
Please mark which ones need optimization, and provide <code>$graph</code> for testing.
</p>

<ul class="org-ul">
<li>I made tentative new variant for 8.6 "Get Specific Concepts"
</li>
<li>Used the standard notation <code>$param</code> to indicate an input parameter, rather than <code>__PARAM__</code>
</li>
<li>Moved <code>FILTER</code> inside <code>GRAPH</code>, and a few more minor changes
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Content Alignment</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The Content Alignment Pipeline (CAP) is a service that executes on KB data and finds articles that are similar or contradictory to the source article.
It is <b>not</b> executed as part of the SIMMO pipeline, but periodically.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-28 Tue&gt;</span></span> checked <a href="http://mklab2.iti.gr/multisensor/index.php/CAP:_Specification_of_the_service">CAP:_Specification_of_the_service</a>. It proposes the following model:
</p>

<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticles&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">Annotation</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasTarget</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304&gt;</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasBody</span>        
    <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-1&gt;</span><span style="color: #b22222;"> ,</span>
    <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-2&gt;</span><span style="color: #b22222;"> ;</span>
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">motivatedBy</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">tagging</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedBy</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/agent/CAPAgent&gt;</span> ;
  <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedAt</span> <span style="color: #8b2252;">"2016-01-11T12:00:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> <span style="color: #228b22;">.</span>

<span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-1&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">SemanticTag</span> ;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">related</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/ca34bb35770bfa55434a0689d64e1e6a60611047&gt;</span> ;
  <span style="color: #228b22;">fise:</span><span style="color: #008b8b;">confidence</span> 0.862 <span style="color: #228b22;">.</span>

<span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304#similarArticle-2&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">SemanticTag</span> ;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">related</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/57e07befbda355c2eca2ee521926071ee9f5c719&gt;</span> ;
  <span style="color: #228b22;">fise:</span><span style="color: #008b8b;">confidence</span> 0.795 <span style="color: #228b22;">.</span>

<span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/agent/CAPAgent&gt;</span>
  <span style="color: #a020f0;">a</span> <span style="color: #228b22;">prov:</span><span style="color: #008b8b;">SoftwareAgent</span> ;
  <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">name</span> <span style="color: #8b2252;">"Content Alignment Pipeline v1.0"</span> .
</pre>
</div>

<p>
Each annotation is symmetric, so it's written twice: in the SIMMO graphs of each of the two SIMMOs.
This complicates data management, because both of these graphs need to be updated.
</p>
</div>
