Multisensor/validation.html

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> <span class="todo TODO">TODO</span> One Annotation Per Pair&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Babis">Babis</span></span></h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
After consultation with Babis, we decided to change the representation as follows:
</p>
<ul class="org-ul">
<li>Write annotations in their own graph <a href="http://data.multisensorproject.eu/CAP">http://data.multisensorproject.eu/CAP</a>, outside of any SIMMO graph.
The CAP service will be called periodically, search globally in the SIMMO DB, and overwrite the similarity graph.
</li>
<li>Write one annotation per pair
</li>
<li>Use custom <code>oa:motivatedBy</code>: <code>ms:linking-similar</code> vs <code>ms:linking-contradictory</code> to express similarity vs contradiction
</li>
</ul>

<p>
In the previous example, assume that the first related article is <b>similar</b> but the second is <b>contradictory</b>.
We restructure it as follows, where <code>similarity/123</code> and <code>similarity/124</code> are GUIDs or some other way to generate unique URLs.
Please note that the representation is completely symmetric regarding the two SIMMOs being linked, 
so there's no need to repeat for the other SIMMO.
</p>

<div class="org-src-container">

<pre class="src src-Turtle">graph <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/CAP&gt;</span> {
  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/CAP/123&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">Annotation</span>;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasBody</span>        
      <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304&gt;</span>,
      <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/ca34bb35770bfa55434a0689d64e1e6a60611047&gt;</span>;
    <span style="color: #228b22;">fise:</span><span style="color: #008b8b;">confidence</span> 0.862;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">motivatedBy</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">linking-similar</span>;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedBy</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/agent/CAP&gt;</span>;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedAt</span> <span style="color: #8b2252;">"2016-01-11T12:00:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> .

  <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/CAP/124&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">Annotation</span>;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">hasBody</span>        
      <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/53a0938bc4770c6ba0e7d7b9ca88a637f9e9c304&gt;</span>,
      <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/content/57e07befbda355c2eca2ee521926071ee9f5c719&gt;</span>;
    <span style="color: #228b22;">fise:</span><span style="color: #008b8b;">confidence</span> 0.795;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">motivatedBy</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;">linking-contradictory</span>;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedBy</span> <span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/agent/CAP&gt;</span>;
    <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">annotatedAt</span> <span style="color: #8b2252;">"2016-01-12T12:00:00"</span><span style="color: #008b8b;">^^xsd:dateTime</span> .
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> <span class="todo TODO">TODO</span> Use ms:score not fise:confidence for CAP</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
In an example sent by Babis, I see fise:confidence=1.6439653807554948. 
But confidence is the probability that something is true, so it should be &lt;=1.
Guess this is some other sort of <b>score</b>, and maybe it's better to use our own property?
</p>

<p>
Decided with Babis to use a custom property <code>ms:score</code> (see next).
</p>
</div>
</div>

<div id="outline-container-sec-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="section-number-4">2.4.3</span> <span class="todo TODO">TODO</span> Add to Ontology&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Vladimir">Vladimir</span></span></h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
The following will be in <a href="./img/ontology.ttl">./img/ontology.ttl</a>, so they don't need to be repeated by CAP for every similarity link.
</p>
<div class="org-src-container">

<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;http://data.multisensorproject.eu/agent/CAP&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">prov:</span><span style="color: #008b8b;">SoftwareAgent</span>;
  <span style="color: #228b22;">foaf:</span><span style="color: #008b8b;">name</span> <span style="color: #8b2252;">"Content Alignment Pipeline v1.0"</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">linking-similar</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">owl:</span><span style="color: #008b8b;">NamedIndividual,</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">Motivation</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">motivationScheme</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">broader</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">linking</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"linking-similar"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Motivation that represents a symmetric link between two *similar* articles"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">isDefinedBy</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;"> </span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">linking-contradictory</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">owl:</span><span style="color: #008b8b;">NamedIndividual,</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">Motivation</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">motivationScheme</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">broader</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">linking</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"linking-contradictory"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Motivation that represents a symmetric link between two *contradictory* articles"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">isDefinedBy</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;"> </span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">ms:</span><span style="color: #008b8b;">score</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">owl:</span><span style="color: #008b8b;">DatatypeProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">domain</span> <span style="color: #228b22;">oa:</span><span style="color: #008b8b;">Annotation</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span>  <span style="color: #228b22;">xsd:</span><span style="color: #008b8b;">decimal</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"score"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Strength of an Annotation, eg the link between two entities"</span>@en;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">isDefinedBy</span> <span style="color: #228b22;">ms:</span><span style="color: #008b8b;"> </span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-4" class="outline-4">
<h4 id="sec-2-4-4"><span class="section-number-4">2.4.4</span> CAP Query</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
Given a <code>$simmo</code>, find similar or contradictory articles, and their similarity/contradiction scores.
</p>
<div class="org-src-container">

<pre class="src src-sparql"><span style="color: #a020f0;">select</span> <span style="color: #a0522d;">?article</span> <span style="color: #a0522d;">?motivation</span> <span style="color: #a0522d;">?score</span> {
  [a oa:Annotation;
   oa:annotatedBy <span style="color: #008b8b;">&lt;http://data.multisensorproject.eu/agent/CAP&gt;</span>;
   oa:hasBody <span style="color: #a0522d;">$simmo</span>, <span style="color: #a0522d;">?article</span>;
   ms:score <span style="color: #a0522d;">?score</span>;
   oa:motivatedBy <span style="color: #a0522d;">?motivation</span>
  ]
  <span style="color: #a020f0;">filter</span> (<span style="color: #a0522d;">$simmo</span> != <span style="color: #a0522d;">?article</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-5" class="outline-4">
<h4 id="sec-2-4-5"><span class="section-number-4">2.4.5</span> <span class="todo TODO">TODO</span> Other CAP Queries</h4>
<div class="outline-text-4" id="text-2-4-5">
<p>
The gdoc maybe has 2 queries related to CAP. Not sure I'm looking at the right section. Maybe we should just delete them.
</p>
<ul class="org-ul">
<li>2.8 "Retrieve the concepts in the SIMMO (Select)": wrote something simple
</li>
<li>2.9 "Retrieve the concepts in the SIMMO (Construct)": don't know what is needed
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-06-29&gt;</span></span></p>
<p class="author">Author: Vladimir Alexiev</p>
<p class="creator">Emacs 25.0.50.1 (Org mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
